apojomovsky/epic-hal/pic16f193x-hal/src/peripherals/pic16f193x_gpio.c
/**
 * GPIO driver, implementation matching datasheet §6.0/§7.0: writes
 * target LATx, reads come from PORTx (pin level); ANSELx selects
 * analog/digital per pin; WPUB gives per-pin PORTB weak pull-ups gated
 * by the global WPUEN (OPTION_REG<7>). All SFR accesses use
 * compile-time-constant `PIC_REG_*` tokens; the per-port dispatch
 * branches before touching any SFR.
 */

#include "peripherals/pic16f193x_gpio.h"
#include "core/pic16f193x_irq.h"

/**
 * @brief Map a port to the address of its TRISx direction register.
 * @param port GPIO port identifier
 * @return the PIC_REG_TRISx token for the port (TRISA for unknown ports)
 */
static uint16_t tris_addr(GPIO_TypeDef port)
{
    switch (port)
    {
        case GPIOA: return PIC_REG_TRISA;
        case GPIOB: return PIC_REG_TRISB;
        case GPIOC: return PIC_REG_TRISC;
#if PIC16F193X_FAMILY_HAS_PORTD
        case GPIOD: return PIC_REG_TRISD;
#endif
#if PIC16F193X_FAMILY_HAS_PORTE
        case GPIOE: return PIC_REG_TRISE;
#endif
        default:    return PIC_REG_TRISA;
    }
}

/**
 * @brief Map a port to the address of its LATx output latch register.
 * @param port GPIO port identifier
 * @return the PIC_REG_LATx token for the port (LATA for unknown ports)
 */
static uint16_t lat_addr(GPIO_TypeDef port)
{
    switch (port)
    {
        case GPIOA: return PIC_REG_LATA;
        case GPIOB: return PIC_REG_LATB;
        case GPIOC: return PIC_REG_LATC;
#if PIC16F193X_FAMILY_HAS_PORTD
        case GPIOD: return PIC_REG_LATD;
#endif
#if PIC16F193X_FAMILY_HAS_PORTE
        case GPIOE: return PIC_REG_LATE;
#endif
        default:    return PIC_REG_LATA;
    }
}

/**
 * @brief Map a port to the address of its PORTx pin-level register.
 * @param port GPIO port identifier
 * @return the PIC_REG_PORTx token for the port (PORTA for unknown ports)
 */
static uint16_t port_addr(GPIO_TypeDef port)
{
    switch (port)
    {
        case GPIOA: return PIC_REG_PORTA;
        case GPIOB: return PIC_REG_PORTB;
        case GPIOC: return PIC_REG_PORTC;
#if PIC16F193X_FAMILY_HAS_PORTD
        case GPIOD: return PIC_REG_PORTD;
#endif
#if PIC16F193X_FAMILY_HAS_PORTE
        case GPIOE: return PIC_REG_PORTE;
#endif
        default:    return PIC_REG_PORTA;
    }
}

/**
 * @brief Map a port to the address of its ANSELx analog-select register.
 * @param port GPIO port identifier
 * @return the PIC_REG_ANSELx token for the port, or 0xFFFF for PORTC
 *         which has no ANSEL on this family
 */
static uint16_t ansel_addr(GPIO_TypeDef port)
{
    switch (port)
    {
        case GPIOA: return PIC_REG_ANSELA;
        case GPIOB: return PIC_REG_ANSELB;
#if PIC16F193X_FAMILY_HAS_PORTD
        case GPIOD: return PIC_REG_ANSELD;
#endif
#if PIC16F193X_FAMILY_HAS_PORTE
        case GPIOE: return PIC_REG_ANSELE;
#endif
        /* PORTC has no ANSEL on this family (all digital); fall back to a
         * harmless sentinel the caller never writes when width gates it. */
        default:    return 0xFFFFU;
    }
}

/**
 * @brief Upper pin bound for a port. PORTA/B/C/D = 8, PORTE = 4.
 * @param port GPIO port identifier
 * @return the number of pins on the port
 */
static uint8_t port_width(GPIO_TypeDef port)
{
#if PIC16F193X_FAMILY_HAS_PORTE
    if (port == GPIOE) return 4U;
#endif
    return 8U;
}

/**
 * @brief Configure one or more pins of a port to the same mode.
 * @param port GPIOA..GPIOE
 * @param pins bitmask of GPIO_PIN_0 .. GPIO_PIN_All
 * @param mode one of GPIO_ModeTypeDef
 */
void EPIC_GPIO_Init(GPIO_TypeDef port, uint16_t pins, GPIO_ModeTypeDef mode)
{
    uint8_t mask = (uint8_t)pins & (uint8_t)((1U << port_width(port)) - 1U);
    uint16_t ta  = tris_addr(port);
    uint16_t la  = lat_addr(port);
    uint16_t aa  = ansel_addr(port);

    uint8_t tris  = EPIC_REG8(ta);
    uint8_t lat   = EPIC_REG8(la);
    uint8_t ansel = (aa != 0xFFFFU) ? EPIC_REG8(aa) : 0U;

    switch (mode)
    {
        case GPIO_MODE_INPUT:
            tris  |= mask;
            ansel &= (uint8_t)~mask;   /* digital input. */
            break;
        case GPIO_MODE_OUTPUT:
            tris  &= (uint8_t)~mask;
            ansel &= (uint8_t)~mask;   /* digital output. */
            lat   &= (uint8_t)~mask;   /* start driving low. */
            break;
        case GPIO_MODE_ANALOG:
            tris  |= mask;
            ansel |= mask;
            break;
        default:
            return;
    }
    EPIC_REG8(ta) = tris;
    if (aa != 0xFFFFU) EPIC_REG8(aa) = ansel;
    EPIC_REG8(la) = lat;
}

/**
 * @brief Restore all pins of `port` to reset (input, analog, latch
 *        clear).
 * @param port GPIOA..GPIOE
 */
void EPIC_GPIO_DeInit(GPIO_TypeDef port)
{
    uint16_t ta = tris_addr(port);
    uint16_t la = lat_addr(port);
    uint16_t aa = ansel_addr(port);
    /* Reset to POR: input, analog, latch clear. */
    EPIC_REG8(ta) = (uint8_t)((1U << port_width(port)) - 1U);
    if (aa != 0xFFFFU) EPIC_REG8(aa) = (uint8_t)((1U << port_width(port)) - 1U);
    EPIC_REG8(la) = 0x00U;
}

/**
 * @brief Drive a pin high or low; ORs/ANDs the mask onto the LATx latch.
 * @param port GPIOA..GPIOE
 * @param pins bitmask of pins to drive
 * @param state GPIO_PIN_SET or GPIO_PIN_RESET
 */
void EPIC_GPIO_WritePin(GPIO_TypeDef port, uint16_t pins, GPIO_PinState state)
{
    uint8_t mask = (uint8_t)pins & (uint8_t)((1U << port_width(port)) - 1U);
    uint16_t la = lat_addr(port);
    uint8_t cur = EPIC_REG8(la);
    if (state == GPIO_PIN_SET) cur |= mask;
    else                       cur &= (uint8_t)~mask;
    EPIC_REG8(la) = cur;
}

/**
 * @brief Toggle a set of pins (LATx ^= mask).
 * @param port GPIOA..GPIOE
 * @param pins bitmask of pins to toggle
 */
void EPIC_GPIO_TogglePin(GPIO_TypeDef port, uint16_t pins)
{
    uint8_t mask = (uint8_t)pins & (uint8_t)((1U << port_width(port)) - 1U);
    uint16_t la = lat_addr(port);
    EPIC_REG8(la) = EPIC_REG8(la) ^ mask;
}

/**
 * @brief Read the current level seen on `pins` from PORTx.
 * @param port GPIOA..GPIOE
 * @param pins bitmask of pins to read
 * @return GPIO_PIN_SET if any selected pin reads high, GPIO_PIN_RESET
 *         otherwise
 */
GPIO_PinState EPIC_GPIO_ReadPin(GPIO_TypeDef port, uint16_t pins)
{
    uint8_t mask = (uint8_t)pins & (uint8_t)((1U << port_width(port)) - 1U);
    uint16_t pa = port_addr(port);
    return (EPIC_REG8(pa) & mask) ? GPIO_PIN_SET : GPIO_PIN_RESET;
}

/**
 * @brief Atomically write the entire port LATx latch.
 * @param port GPIOA..GPIOE
 * @param value byte to write, masked to the port width
 */
void EPIC_GPIO_WritePort(GPIO_TypeDef port, uint8_t value)
{
    uint8_t mask = (uint8_t)((1U << port_width(port)) - 1U);
    EPIC_REG8(lat_addr(port)) = (uint8_t)(value & mask);
}

/**
 * @brief Read the entire port (PORTx, pin level).
 * @param port GPIOA..GPIOE
 * @return the port's current pin levels
 */
uint8_t EPIC_GPIO_ReadPort(GPIO_TypeDef port)
{
    return EPIC_REG8(port_addr(port));
}

/**
 * @brief Enable or disable the PORTB per-pin weak pull-ups via WPUB,
 *        gated by the global WPUEN enable. Non-PORTB ports are ignored.
 * @param port GPIO port identifier (only GPIOB is affected)
 * @param pins bitmask of PORTB pins to select
 * @param state GPIO_PIN_SET enables the selected pull-ups, GPIO_PIN_RESET
 *        disables them
 */
void EPIC_GPIO_SetPullups(GPIO_TypeDef port, uint16_t pins, GPIO_PinState state)
{
    /* Weak pull-ups on this family are PORTB-only via WPUB (DS41364B
     * §6.0), gated by the global WPUEN (OPTION_REG<7>, active-low). */
    if (port != GPIOB) return;
    uint8_t mask = (uint8_t)pins & (uint8_t)((1U << port_width(port)) - 1U);

    if (state == GPIO_PIN_SET)
    {
        EPIC_REG8(PIC_REG_WPUB) |= mask;
        /* WPUEN = 0 enables the per-pin pull-ups. */
        EPIC_BIT_CLR(EPIC_REG8(PIC_REG_OPTION), PIC_OPTION_WPUEN);
    }
    else
    {
        EPIC_REG8(PIC_REG_WPUB) &= (uint8_t)~mask;
        /* If no PORTB pin still wants a pull-up, disable globally. */
        if (EPIC_REG8(PIC_REG_WPUB) == 0U)
        {
            EPIC_BIT_SET(EPIC_REG8(PIC_REG_OPTION), PIC_OPTION_WPUEN);
        }
    }
}

static void (*s_ioc_callback)(uint8_t iocbf, uint8_t portb) = NULL;

/**
 * @brief Register a callback fired from the PORTB interrupt-on-change.
 * @param callback function called with the IOCBF mask and the freshly
 *        read PORTB byte, or NULL to unregister
 */
void EPIC_GPIO_RegisterChangeCallback(void (*callback)(uint8_t, uint8_t))
{
    s_ioc_callback = callback;
}

/**
 * @brief Enable per-pin positive/negative edge detection on PORTB.
 * @param pos_mask bitmask of pins to detect rising edges on
 * @param neg_mask bitmask of pins to detect falling edges on
 */
void EPIC_GPIO_EnableChangeDetect(uint8_t pos_mask, uint8_t neg_mask)
{
    EPIC_REG8(PIC_REG_IOCBP) = pos_mask;
    EPIC_REG8(PIC_REG_IOCBN) = neg_mask;
}

/**
 * @brief Weak PORTB change-interrupt ISR: reads IOCBF and PORTB, clears
 *        IOCBF/IOCIF, then forwards (iocbf, portb) to the callback.
 */
void IOC_IRQHandler(void)
{
    /* Direct flag ops (class-F: the table route clobbers PCLATH in ISR
     * context; the ccp_irq_common switch is the reference). IOCIF is
     * INTCON bit 0. */
    if (!(EPIC_REG8(PIC_REG_INTCON) & PIC_INTCON_IOCIF)) return;

    /* Read IOCBF (which pins changed) and PORTB before clearing, the
     * mismatch comparator only re-arms once PORTB is read (DS41364B
     * §7.0), matching classic PIC16's read-before-clear requirement. */
    uint8_t iocbf = EPIC_REG8(PIC_REG_IOCBF);
    uint8_t portb = EPIC_REG8(PIC_REG_PORTB);
    EPIC_REG8(PIC_REG_IOCBF) = 0x00U;
    EPIC_BIT_CLR(EPIC_REG8(PIC_REG_INTCON), PIC_INTCON_IOCIF);
    if (s_ioc_callback) s_ioc_callback(iocbf, portb);
}
